README.org
* pds-ppi-helper

A helpful python package for interfacing with the Planetary Plasma Interactions node on NASA's Planetary Data System ([[https://pds-ppi.igpp.ucla.edu/][PDS-PPI]])!

** Installation
1) Download or clone this repository.
2) From within =pds-ppi-helper/=, run the following command to install the package: =pip install .=
3) Try running =pds-ppi-helper/example_script.py= either from the command line
   with =$ python example_script.py= or from the Ipython terminal with =%run example_script.py=

** Examples
*** Do a search
#+BEGIN_SRC python
import pds_ppi_helper as pds

my_search = pds.search(target = 'Europa', nrows = '10', keyword='highres')

print('Found {} results!'.format(my_search.numfound))
print(my_search.results)
#+END_SRC
    
